function toFaWord(num) {
    uniqNumbers = { // A dictionary for unique numbers that we cannot construct from their combinations
        1: ['یک', "یاز"],
        2: ["دو", "دواز"],
        3: ["سه", "سیز", "سی"],
        4: ["چهار"],
        5: ["پنج", "پانز", "پان"],
        6: ["شش", "شانز"],
        7: ["هفت", "هف"],
        8: ["هشت", "هج", "هش"],
        9: ["نه", "نوز"],
        10: ["ده"],
        20: ["بیست"],
        30: ["سی"],
        40: ["چهل"],
        50: ["پنجاه"],
        60: ["شصت"],
        70: ["هفتاد"],
        80: ["هشتاد"],
        90: ["نود"],
        100: ["صد","یست"],
        1000: ["هزار"],
        1000000: ["میلیون"],
        1000000000: ["میلیارد"],
    }

    return uniqNumbers(num)
}